// 클래스 한개를 만들때 사용되는 문법들
// 1. 접근 지정자 : private, public 
//	               class vs struct 차이점
//				
// 2. 객체 지향 프로그래밍의 3대 특징 : "캡슐화", "상속", "다형성"
//    Object Oriented Programming

// 3. 생성자, 소멸자 
//		=> "멤버 초기화 리스트" : 생성자() 뒤에 :으로 초기화 하는 기술
// 
// 4. static member data      : 모든 객체가 공유하는 데이타
//    static member function  : 객체 없이 호출가능한 함수
// 5. const member function 개념, 필요성 (상수 객체 고려, 
//									함수 인자를 "const Rect& " 등으로 할때 고려)
// 6. 멤버 함수의 호출원리와 this 

// 7. 객체의 복사 와 복사 생성자 <= 앞으로 배울 내용
//----------------------------------------클래스 한개 만들때 필요한 개념
// >>> 남은것. 여러 클래스로 커다란 프로그램을 만들어 가는 과정
//     상속과 디자인..
